zephyrproject-rtos/hal_nxp/mcux/drivers/imxrt6xx/fsl_casper.c
/* Set the prime modulus mod in Casper memory.
 */
void CASPER_ecc_init(void)
{
#if CASPER_ECC_P256
    N_wordlen     = 256U / 32U;
    uint32_t *mod = NISTp256;
#elif CASPER_ECC_P384
    N_wordlen     = 384U / 32U;
    uint32_t *mod = NISTp384;
#endif
    CASPER_MEMCPY(&CASPER_MEM[MOD_SCRATCH_START], mod, NUM_LIMBS * sizeof(uint32_t));
    uint8_t a[(CASPER_NUM_LIMBS - NUM_LIMBS) * sizeof(uint32_t)] = {0};
    CASPER_MEMCPY(&CASPER_MEM[MOD_SCRATCH_START + NUM_LIMBS], a, (CASPER_NUM_LIMBS - NUM_LIMBS) * sizeof(uint32_t));
}

void CASPER_ECC_equal(int *res, uint32_t *op1, uint32_t *op2)
{
    uint32_t a[NUM_LIMBS];
    uint32_t b[NUM_LIMBS];
    uint32_t c = 0;
    CASPER_MEMCPY(a, op1, NUM_LIMBS * sizeof(uint32_t));
    CASPER_MEMCPY(b, op2, NUM_LIMBS * sizeof(uint32_t));

    do
    {
        uint32_t _i;
        c = (a[0] ^ b[0]);
        for (_i = 1; _i < NUM_LIMBS; _i++)
        {
            c |= (a[_i] ^ b[_i]);
        }
    } while (false);

    *res = (int32_t)c;
}

void CASPER_ECC_equal_to_zero(int *res, uint32_t *op1)
{
    uint32_t a[NUM_LIMBS];
    uint32_t c = 0;
    CASPER_MEMCPY(a, op1, NUM_LIMBS * sizeof(uint32_t));

    do
    {
        uint32_t _i;
        c = a[0];
        for (_i = 1; _i < NUM_LIMBS; _i++)
        {
            c |= a[_i];
        }
    } while (false);

    *res = (int32_t)c;
}

#if CASPER_ECC_P256
void CASPER_ECC_SECP256R1_Mul(
    CASPER_Type *base, uint32_t resX[8], uint32_t resY[8], uint32_t X[8], uint32_t Y[8], uint32_t scalar[8])
{
    uint32_t X1[8] = {0};
    uint32_t Y1[8] = {0};
    toMontgomery(X1, X);
    toMontgomery(Y1, Y);

    CASPER_MEMCPY(&CASPER_MEM[INOUT_SCRATCH_START + 0U * CASPER_NUM_LIMBS], X1, NUM_LIMBS * sizeof(uint32_t));
    CASPER_MEMCPY(&CASPER_MEM[INOUT_SCRATCH_START + 1U * CASPER_NUM_LIMBS], Y1, NUM_LIMBS * sizeof(uint32_t));

    Jac_scalar_multiplication(&CASPER_MEM[INOUT_SCRATCH_START + 6U * CASPER_NUM_LIMBS],
                              &CASPER_MEM[INOUT_SCRATCH_START + 7U * CASPER_NUM_LIMBS],
                              &CASPER_MEM[INOUT_SCRATCH_START + 8U * CASPER_NUM_LIMBS],
                              &CASPER_MEM[INOUT_SCRATCH_START + 0U * CASPER_NUM_LIMBS],
                              &CASPER_MEM[INOUT_SCRATCH_START + 1U * CASPER_NUM_LIMBS], scalar, NISTp256, NISTp256_q);

    Jac_toAffine(&CASPER_MEM[INOUT_SCRATCH_START + 3U * CASPER_NUM_LIMBS],
                 &CASPER_MEM[INOUT_SCRATCH_START + 4U * CASPER_NUM_LIMBS],
                 &CASPER_MEM[INOUT_SCRATCH_START + 6U * CASPER_NUM_LIMBS],
                 &CASPER_MEM[INOUT_SCRATCH_START + 7U * CASPER_NUM_LIMBS],
                 &CASPER_MEM[INOUT_SCRATCH_START + 8U * CASPER_NUM_LIMBS]);

    /* Montgomery to Normal */
    /* X_normal = 1 * X_montgomery; Y_normal = 1 * Y_montgomery */
    uint32_t one[CASPER_NUM_LIMBS] = {0x0};
    one[0]                         = 0x1u;
    CASPER_MEMCPY(&CASPER_MEM[INOUT_SCRATCH_START + 0U * CASPER_NUM_LIMBS], one, CASPER_NUM_LIMBS * sizeof(uint32_t));
    multiply_casper(&CASPER_MEM[INOUT_SCRATCH_START + 5U * CASPER_NUM_LIMBS],
                    &CASPER_MEM[INOUT_SCRATCH_START + 3U * CASPER_NUM_LIMBS],
                    &CASPER_MEM[INOUT_SCRATCH_START + 0U * CASPER_NUM_LIMBS]);
    multiply_casper(&CASPER_MEM[INOUT_SCRATCH_START + 6U * CASPER_NUM_LIMBS],
                    &CASPER_MEM[INOUT_SCRATCH_START + 4U * CASPER_NUM_LIMBS],
                    &CASPER_MEM[INOUT_SCRATCH_START + 0U * CASPER_NUM_LIMBS]);

    /* copy out to result */
    CASPER_MEMCPY(resX, &CASPER_MEM[INOUT_SCRATCH_START + 5U * CASPER_NUM_LIMBS], NUM_LIMBS * sizeof(uint32_t));
    CASPER_MEMCPY(resY, &CASPER_MEM[INOUT_SCRATCH_START + 6U * CASPER_NUM_LIMBS], NUM_LIMBS * sizeof(uint32_t));
}

void CASPER_ECC_SECP256R1_MulAdd(CASPER_Type *base,
                                 uint32_t resX[8],
                                 uint32_t resY[8],
                                 uint32_t X1[8],
                                 uint32_t Y1[8],
                                 uint32_t scalar1[8],
                                 uint32_t X2[8],
                                 uint32_t Y2[8],
                                 uint32_t scalar2[8])
{
    uint32_t zeroes[CASPER_NUM_LIMBS] = {0};

    CASPER_MEMCPY(&CASPER_MEM[INOUT_SCRATCH_START + 0U * CASPER_NUM_LIMBS], X1, NUM_LIMBS * sizeof(uint32_t));
    CASPER_MEMCPY(&CASPER_MEM[INOUT_SCRATCH_START + 1U * CASPER_NUM_LIMBS], Y1, NUM_LIMBS * sizeof(uint32_t));

    CASPER_MEMCPY(&CASPER_MEM[INOUT_SCRATCH_START + 2U * CASPER_NUM_LIMBS], X2, NUM_LIMBS * sizeof(uint32_t));
    CASPER_MEMCPY(&CASPER_MEM[INOUT_SCRATCH_START + 3U * CASPER_NUM_LIMBS], Y2, NUM_LIMBS * sizeof(uint32_t));

    toMontgomery(&CASPER_MEM[INOUT_SCRATCH_START + 0U * CASPER_NUM_LIMBS],
                 &CASPER_MEM[INOUT_SCRATCH_START + 0U * CASPER_NUM_LIMBS]);
    toMontgomery(&CASPER_MEM[INOUT_SCRATCH_START + 1U * CASPER_NUM_LIMBS],
                 &CASPER_MEM[INOUT_SCRATCH_START + 1U * CASPER_NUM_LIMBS]);
    toMontgomery(&CASPER_MEM[INOUT_SCRATCH_START + 2U * CASPER_NUM_LIMBS],
                 &CASPER_MEM[INOUT_SCRATCH_START + 2U * CASPER_NUM_LIMBS]);
    toMontgomery(&CASPER_MEM[INOUT_SCRATCH_START + 3U * CASPER_NUM_LIMBS],
                 &CASPER_MEM[INOUT_SCRATCH_START + 3U * CASPER_NUM_LIMBS]);

    CASPER_MEMCPY(&CASPER_MEM[INOUT_SCRATCH_START + 4U * CASPER_NUM_LIMBS], zeroes,
                  CASPER_NUM_LIMBS * sizeof(uint32_t));
    CASPER_MEMCPY(&CASPER_MEM[INOUT_SCRATCH_START + 5U * CASPER_NUM_LIMBS], zeroes,
                  CASPER_NUM_LIMBS * sizeof(uint32_t));
    CASPER_MEMCPY(&CASPER_MEM[INOUT_SCRATCH_START + 6U * CASPER_NUM_LIMBS], zeroes,
                  CASPER_NUM_LIMBS * sizeof(uint32_t));
    double_scalar_multiplication(&CASPER_MEM[INOUT_SCRATCH_START + 4U * CASPER_NUM_LIMBS],
                                 &CASPER_MEM[INOUT_SCRATCH_START + 5U * CASPER_NUM_LIMBS],
                                 &CASPER_MEM[INOUT_SCRATCH_START + 6U * CASPER_NUM_LIMBS],
                                 &CASPER_MEM[INOUT_SCRATCH_START + 0U * CASPER_NUM_LIMBS],
                                 &CASPER_MEM[INOUT_SCRATCH_START + 1U * CASPER_NUM_LIMBS], scalar1,
                                 &CASPER_MEM[INOUT_SCRATCH_START + 2U * CASPER_NUM_LIMBS],
                                 &CASPER_MEM[INOUT_SCRATCH_START + 3U * CASPER_NUM_LIMBS], scalar2);

