zephyrproject-rtos/hal_nxp/mcux/drivers/imxrt6xx/fsl_casper.c
#if 0
/* Dumb n-limb subtraction of c=a-b, return borrow. */
static uint32_t sub_n_1(uint32_t *c, uint32_t *a, uint32_t b, int n) {
  int i;
  uint32_t borrow;
  sub_borrowout(borrow, c[0], a[0], b);
  for (i = 1; i < n; i++) {
    sub_borrowin_borrowout_1(borrow, c[i], a[i], borrow);
  }
  return borrow;
}

/* Dumb n-limb addition of c=a+b, return carry. */
static uint32_t add_n(uint32_t *c, uint32_t *a, uint32_t *b, int n) {
  int i;
  uint32_t carry;
  add_cout(carry, c[0], a[0], b[0]);
  for (i = 1; i < n; i++) {
    add_cout_cin(carry, c[i], a[i], b[i], carry);
  }
  return carry;
}
#endif

/* Dumb n-limb addition of c=a+b, return carry. */
static uint32_t add_n_1(uint32_t *c, uint32_t *a, uint32_t b, int n)
{
    int i;
    uint32_t carry;
    add_cout(carry, c[0], a[0], b);
    for (i = 1; i < n; i++)
    {
        add_cout_cin(carry, c[i], a[i], 0U, carry);
    }
    return carry;
}

static uint8_t int8abs(int8_t v)
{
    return ((v < 0) ? ((uint8_t)-v) : ((uint8_t)v));
}

/* Constant time elliptic curve scalar multiplication.
 * Source: https://eprint.iacr.org/2014/130.pdf
 * when using w = 4.
 * Computes (X3 : Y3 : Z3) = k * (X1, Y1) \in E(F_p)
 * p is the prime used to define the finite field F_p
 * q is the (prime) order of the curve
 */
void Jac_scalar_multiplication(
    uint32_t *X3, uint32_t *Y3, uint32_t *Z3, uint32_t *X1, uint32_t *Y1, uint32_t *k, uint32_t *p, uint32_t *q)
{
    uint32_t *scalar, *M, *X, *Y, *Z, *mem;
    int i, sign, odd;
    // int8_t *rec;
    uint8_t index;

    /* Point to the start of the LUT table space. */
    mem = &CASPER_MEM[LUT_SCRATCH_START];

    scalar = &CASPER_MEM[LUT_SCRATCH_START + 12U * CASPER_NUM_LIMBS];
    X      = &CASPER_MEM[LUT_SCRATCH_START + 13U * CASPER_NUM_LIMBS];
    Y      = &CASPER_MEM[LUT_SCRATCH_START + 14U * CASPER_NUM_LIMBS];
    Z      = &CASPER_MEM[LUT_SCRATCH_START + 15U * CASPER_NUM_LIMBS];
    M      = &CASPER_MEM[LUT_SCRATCH_START + 16U * CASPER_NUM_LIMBS];

    /* Point to memory the recoded scalar.
     * CASPER_RECODE_LENGTH bytes is needed.
     */
    // rec = (int8_t*)&CASPER_MEM[LUT_SCRATCH_START + 17 * CASPER_NUM_LIMBS];
    int8_t rec[CASPER_RECODE_LENGTH] = {0};

    CASPER_MEMCPY(scalar, k, sizeof(uint32_t) * NUM_LIMBS);

/* Precomputation: compute 1*P, 3*P, 5*P, and 7*P */
#define FSL_CASPER_LUT(P, x) (mem + (3U * ((P)-1U) / 2U + (x)) * CASPER_NUM_LIMBS)

    /* Set 1*P */
    copy(Z3, ONE);
    copy(FSL_CASPER_LUT(1U, 0U), X1);
    copy(FSL_CASPER_LUT(1U, 1U), Y1);
    copy(FSL_CASPER_LUT(1U, 2U), Z3);

    /* Compute 2*P */
    Jac_double(X3, Y3, Z3, X1, Y1, Z3);

    /* Compute 3*P = 2P + P */
    Jac_add_affine(FSL_CASPER_LUT(3U, 0U), FSL_CASPER_LUT(3U, 1U), FSL_CASPER_LUT(3U, 2U), X3, Y3, Z3, X1, Y1);

    /* Compute 5*P = 3P + 2P */
    Jac_addition(FSL_CASPER_LUT(5U, 0U), FSL_CASPER_LUT(5U, 1U), FSL_CASPER_LUT(5U, 2U), FSL_CASPER_LUT(3U, 0U),
                 FSL_CASPER_LUT(3U, 1U), FSL_CASPER_LUT(3U, 2U), X3, Y3, Z3);

    /* Compute 7*P = 5P + 2P */
    Jac_addition(FSL_CASPER_LUT(7U, 0U), FSL_CASPER_LUT(7U, 1U), FSL_CASPER_LUT(7U, 2U), FSL_CASPER_LUT(5U, 0U),
                 FSL_CASPER_LUT(5U, 1U), FSL_CASPER_LUT(5U, 2U), X3, Y3, Z3);

    /* Recode the scalar */
    odd = (int32_t)((uint32_t)(casper_get_word(&scalar[0]) & 1U));
    (void)sub_n(M, q, scalar, (int16_t)(uint16_t)NUM_LIMBS); // todo!!!
    casper_select(scalar, M, scalar, odd, (int16_t)(uint16_t)NUM_LIMBS);

    /* Use n=384 and w=4 --> compute ciel(384/3) = 128 + 1 digits */
    uint32_t scalarSysram[/*CASPER_*/ NUM_LIMBS];
    CASPER_MEMCPY(scalarSysram, scalar, /*CASPER_*/ NUM_LIMBS * sizeof(uint32_t));
    recode(rec, scalarSysram, (int32_t)N_bitlen, 4);

    /* Set the first value. */
    index = int8abs(rec[CASPER_RECODE_LENGTH - 1]);
    sign  = (int32_t)(uint32_t)(uint8_t)(((uint8_t)rec[CASPER_RECODE_LENGTH - 1]) >> 7);
    copy(X3, FSL_CASPER_LUT(index, 0U));
    copy(Y3, FSL_CASPER_LUT(index, 1U));
    copy(Z3, FSL_CASPER_LUT(index, 2U));

    /* Get the correct LUT element in constant time by touching
     * all elements and masking out the correct one.
     */

#define GET_LUT(x, y, z, index)                                                           \
    do                                                                                    \
    {                                                                                     \
        int m;                                                                            \
        copy((x), FSL_CASPER_LUT(1U, 0U));                                                \
        copy((y), FSL_CASPER_LUT(1U, 1U));                                                \
        copy((z), FSL_CASPER_LUT(1U, 2U));                                                \
        m = (int32_t)((index) == 3U);                                                     \
        casper_select((x), (x), FSL_CASPER_LUT(3U, 0U), m, (int16_t)(uint16_t)NUM_LIMBS); \
        casper_select((y), (y), FSL_CASPER_LUT(3U, 1U), m, (int16_t)(uint16_t)NUM_LIMBS); \
        casper_select((z), (z), FSL_CASPER_LUT(3U, 2U), m, (int16_t)(uint16_t)NUM_LIMBS); \
        m = (int32_t)((index) == 5U);                                                     \
        casper_select((x), (x), FSL_CASPER_LUT(5U, 0U), m, (int16_t)(uint16_t)NUM_LIMBS); \
        casper_select((y), (y), FSL_CASPER_LUT(5U, 1U), m, (int16_t)(uint16_t)NUM_LIMBS); \
        casper_select((z), (z), FSL_CASPER_LUT(5U, 2U), m, (int16_t)(uint16_t)NUM_LIMBS); \
        m = (int32_t)((index) == 7U);                                                     \
        casper_select((x), (x), FSL_CASPER_LUT(7U, 0U), m, (int16_t)(uint16_t)NUM_LIMBS); \
        casper_select((y), (y), FSL_CASPER_LUT(7U, 1U), m, (int16_t)(uint16_t)NUM_LIMBS); \
        casper_select((z), (z), FSL_CASPER_LUT(7U, 2U), m, (int16_t)(uint16_t)NUM_LIMBS); \
    } while (false)

    GET_LUT(X3, Y3, Z3, index);

    /* Compute -y and select the positive or negative point. */
    (void)sub_n(M, p, Y3, (int16_t)(uint16_t)NUM_LIMBS); // todo!!!
    casper_select(Y3, Y3, M, sign, (int16_t)(uint16_t)NUM_LIMBS);

